; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v4 ?v7)
             (pred_11 ?v9 ?v12)
             (pred_4 ?v4 ?v12)
             (pred_7 ?v10 ?v4 )
	     (pred_12 ?v4)
             (pred_2 ?v8)
             (pred_6 ?v9)
             (pred_8 ?v12)
             (pred_3 ?v4)
             (pred_9 ?v9)
             (pred_5 ?v4)
             (pred_10 ))



(:action op_5
:parameters (?v11 ?v1 ?v5 ?v3)
:precondition (and (pred_2 ?v11) (pred_2 ?v1) (pred_6 ?v5) (pred_8 ?v3)
          (pred_1 ?v11 ?v1) (pred_11 ?v5 ?v3)
                   (pred_4 ?v1 ?v3) (pred_12 ?v11) 
                   (pred_3 ?v1) (pred_9 ?v5))
:effect (and  (pred_5 ?v1) (not (pred_3 ?v1))))


(:action op_4
:parameters (?v11 ?v2)
:precondition (and (pred_2 ?v11) (pred_2 ?v2)
               (pred_12 ?v11) (pred_1 ?v11 ?v2) (pred_5 ?v2))
:effect (and (pred_12 ?v2) (not (pred_12 ?v11))))

(:action op_2
:parameters (?v11 ?v5)
:precondition (and (pred_2 ?v11) (pred_6 ?v5) 
                  (pred_12 ?v11) (pred_7 ?v5 ?v11) (pred_10 ))
:effect (and (pred_9 ?v5)
   (not (pred_7 ?v5 ?v11)) (not (pred_10 ))))


(:action op_1
:parameters (?v11 ?v13 ?v6)
:precondition (and (pred_2 ?v11) (pred_6 ?v13) (pred_6 ?v6)
                  (pred_12 ?v11) (pred_9 ?v6) (pred_7 ?v13 ?v11))
:effect (and (pred_9 ?v13) (pred_7 ?v6 ?v11)
        (not (pred_9 ?v6)) (not (pred_7 ?v13 ?v11))))

(:action op_3
:parameters (?v11 ?v5)
:precondition (and (pred_2 ?v11) (pred_6 ?v5) 
                  (pred_12 ?v11) (pred_9 ?v5))
:effect (and (pred_10 ) (pred_7 ?v5 ?v11) (not (pred_9 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_28 obj_12 obj_29 obj_06 obj_10 obj_08 obj_18 obj_02 obj_23 obj_26 obj_09 obj_17 obj_01 obj_24 obj_25 obj_19 obj_14 obj_13 obj_11 obj_05 obj_30 obj_04 obj_21 obj_22
    obj_27 obj_03
    obj_16 obj_20 obj_15
    )

    (:init
       (pred_10)

       (pred_2 obj_07)
       (pred_2 obj_28)
       (pred_2 obj_12)
       (pred_2 obj_29)
       (pred_2 obj_06)
       (pred_2 obj_10)
       (pred_2 obj_08)
       (pred_2 obj_18)
       (pred_2 obj_02)
       (pred_2 obj_23)
       (pred_2 obj_26)
       (pred_2 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_01)
       (pred_2 obj_24)
       (pred_2 obj_25)
       (pred_2 obj_19)
       (pred_2 obj_14)
       (pred_2 obj_13)
       (pred_2 obj_11)
       (pred_2 obj_05)
       (pred_2 obj_30)
       (pred_2 obj_04)
       (pred_2 obj_21)
       (pred_2 obj_22)
       (pred_8 obj_27)
       (pred_8 obj_03)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_15)

       (pred_1 obj_07 obj_10)
       (pred_1 obj_07 obj_28)
       (pred_1 obj_28 obj_08)
       (pred_1 obj_28 obj_12)
       (pred_1 obj_28 obj_07)
       (pred_1 obj_12 obj_18)
       (pred_1 obj_12 obj_29)
       (pred_1 obj_12 obj_28)
       (pred_1 obj_29 obj_02)
       (pred_1 obj_29 obj_06)
       (pred_1 obj_29 obj_12)
       (pred_1 obj_06 obj_23)
       (pred_1 obj_06 obj_29)
       (pred_1 obj_10 obj_26)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_07)
       (pred_1 obj_08 obj_09)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_08 obj_28)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_18 obj_17)
       (pred_1 obj_18 obj_02)
       (pred_1 obj_18 obj_12)
       (pred_1 obj_18 obj_08)
       (pred_1 obj_02 obj_01)
       (pred_1 obj_02 obj_23)
       (pred_1 obj_02 obj_29)
       (pred_1 obj_02 obj_18)
       (pred_1 obj_23 obj_24)
       (pred_1 obj_23 obj_06)
       (pred_1 obj_23 obj_02)
       (pred_1 obj_26 obj_25)
       (pred_1 obj_26 obj_09)
       (pred_1 obj_26 obj_10)
       (pred_1 obj_09 obj_19)
       (pred_1 obj_09 obj_17)
       (pred_1 obj_09 obj_08)
       (pred_1 obj_09 obj_26)
       (pred_1 obj_17 obj_14)
       (pred_1 obj_17 obj_01)
       (pred_1 obj_17 obj_18)
       (pred_1 obj_17 obj_09)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_01 obj_24)
       (pred_1 obj_01 obj_02)
       (pred_1 obj_01 obj_17)
       (pred_1 obj_24 obj_11)
       (pred_1 obj_24 obj_23)
       (pred_1 obj_24 obj_01)
       (pred_1 obj_25 obj_05)
       (pred_1 obj_25 obj_19)
       (pred_1 obj_25 obj_26)
       (pred_1 obj_19 obj_30)
       (pred_1 obj_19 obj_14)
       (pred_1 obj_19 obj_09)
       (pred_1 obj_19 obj_25)
       (pred_1 obj_14 obj_04)
       (pred_1 obj_14 obj_13)
       (pred_1 obj_14 obj_17)
       (pred_1 obj_14 obj_19)
       (pred_1 obj_13 obj_21)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_13 obj_14)
       (pred_1 obj_11 obj_22)
       (pred_1 obj_11 obj_24)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_05 obj_30)
       (pred_1 obj_05 obj_25)
       (pred_1 obj_30 obj_04)
       (pred_1 obj_30 obj_19)
       (pred_1 obj_30 obj_05)
       (pred_1 obj_04 obj_21)
       (pred_1 obj_04 obj_14)
       (pred_1 obj_04 obj_30)
       (pred_1 obj_21 obj_22)
       (pred_1 obj_21 obj_13)
       (pred_1 obj_21 obj_04)
       (pred_1 obj_22 obj_11)
       (pred_1 obj_22 obj_21)
       (pred_3 obj_30)
       (pred_3 obj_26)
       (pred_3 obj_23)
       (pred_4  obj_30 obj_27)
       (pred_4  obj_26 obj_03)
       (pred_4  obj_23 obj_03)
       (pred_5 obj_07)
       (pred_5 obj_28)
       (pred_5 obj_12)
       (pred_5 obj_29)
       (pred_5 obj_06)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_18)
       (pred_5 obj_02)
       (pred_5 obj_09)
       (pred_5 obj_17)
       (pred_5 obj_01)
       (pred_5 obj_24)
       (pred_5 obj_25)
       (pred_5 obj_19)
       (pred_5 obj_14)
       (pred_5 obj_13)
       (pred_5 obj_11)
       (pred_5 obj_05)
       (pred_5 obj_04)
       (pred_5 obj_21)
       (pred_5 obj_22)

       (pred_11  obj_16 obj_27)
       (pred_11  obj_20 obj_03)
       (pred_11  obj_15 obj_27)
       (pred_7 obj_16 obj_13)
       (pred_7 obj_20 obj_13)
       (pred_7 obj_15 obj_17)
       (pred_12 obj_08)
    )

    (:goal (and
       (pred_7 obj_16 obj_30)
       (pred_7 obj_20 obj_05)
    ))
(:constraints
  (always (not (pred_12 obj_14)))
)
)

; plan
1. (op_4 obj_08 obj_09)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_09)
   goals met: 0 of 2
2. (op_4 obj_09 obj_17)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_17)
   goals met: 0 of 2
3. (op_4 obj_17 obj_01)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_01)
   goals met: 0 of 2
4. (op_4 obj_01 obj_13)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_13)
   goals met: 0 of 2
5. (op_2 obj_13 obj_16)
   deleted: (pred_7 obj_16 obj_13) (pred_10)
   added: (pred_9 obj_16)
   goals met: 0 of 2
6. (op_4 obj_13 obj_21)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_21)
   goals met: 0 of 2
7. (op_4 obj_21 obj_04)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_04)
   goals met: 0 of 2
8. (op_5 obj_04 obj_30 obj_16 obj_27)
   deleted: (pred_3 obj_30)
   added: (pred_5 obj_30)
   goals met: 0 of 2
9. (op_4 obj_04 obj_30)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_30)
   goals met: 0 of 2
10. (op_3 obj_30 obj_16)
   deleted: (pred_9 obj_16)
   added: (pred_10) (pred_7 obj_16 obj_30)
   goals met: 1 of 2
11. (op_4 obj_30 obj_04)
   deleted: (pred_12 obj_30)
   added: (pred_12 obj_04)
   goals met: 1 of 2
12. (op_4 obj_04 obj_21)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_21)
   goals met: 1 of 2
13. (op_4 obj_21 obj_13)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_13)
   goals met: 1 of 2
14. (op_2 obj_13 obj_20)
   deleted: (pred_7 obj_20 obj_13) (pred_10)
   added: (pred_9 obj_20)
   goals met: 1 of 2
15. (op_4 obj_13 obj_21)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_21)
   goals met: 1 of 2
16. (op_4 obj_21 obj_04)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_04)
   goals met: 1 of 2
17. (op_4 obj_04 obj_30)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_30)
   goals met: 1 of 2
18. (op_4 obj_30 obj_05)
   deleted: (pred_12 obj_30)
   added: (pred_12 obj_05)
   goals met: 1 of 2
19. (op_3 obj_05 obj_20)
   deleted: (pred_9 obj_20)
   added: (pred_10) (pred_7 obj_20 obj_05)
   goals met: 2 of 2
